In [92]:
import pandas as pd
import numpy as np

#Criando um dicionário de Séries
d = {'Nomes':pd.Series(['Tom','Tom','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Idade':pd.Series([25,25,25,30,29,23,34,30,51,46]),
   'Qualidade':pd.Series([9,8,3.98,4.5,4.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65]),
   'Projetos_Nota':pd.Series([8,7,3,4,3,4,3,3,2,4,45,3]),
    }

#Criando um DataFrame
df = pd.DataFrame(d)
print(df)

    Idade   Nomes  Projetos_Nota  Qualidade
0    25.0     Tom              8       9.00
1    25.0     Tom              7       8.00
2    25.0   Ricky              3       3.98
3    30.0     Vin              4       4.50
4    29.0   Steve              3       4.20
5    23.0   Smith              4       4.60
6    34.0    Jack              3       3.80
7    30.0     Lee              3       3.78
8    51.0   David              2       2.98
9    46.0  Gasper              4       4.80
10    NaN  Betina             45       4.10
11    NaN  Andres              3       3.65

In [93]:
df.sum() #somatório dos valores dos campos

Idade                                                          318
Nomes            TomTomRickyVinSteveSmithJackLeeDavidGasperBeti...
Projetos_Nota                                                   89
Qualidade                                                    57.39
dtype: object

In [94]:
df.mean() #média dos campos numéricos

Idade            31.800000
Projetos_Nota     7.416667
Qualidade         4.782500
dtype: float64

In [95]:
df.mode() #Calculanado a Moda

    Idade Nomes  Projetos_Nota  Qualidade
0    25.0   Tom            3.0       2.98
1     NaN   NaN            NaN       3.65
2     NaN   NaN            NaN       3.78
3     NaN   NaN            NaN       3.80
4     NaN   NaN            NaN       3.98
5     NaN   NaN            NaN       4.10
6     NaN   NaN            NaN       4.20
7     NaN   NaN            NaN       4.50
8     NaN   NaN            NaN       4.60
9     NaN   NaN            NaN       4.80
10    NaN   NaN            NaN       8.00
11    NaN   NaN            NaN       9.00

In [96]:
df.count() #A idade tem menos que as outras colunas, tendo campos vazios.

Idade            10
Nomes            12
Projetos_Nota    12
Qualidade        12
dtype: int64

In [97]:
#Contando a quantidade por valor, e, também dos valores NaN
dfv = df['Idade'].value_counts(dropna=False) 
print(dfv)

 25.0    3
NaN      2
 30.0    2
 46.0    1
 51.0    1
 34.0    1
 23.0    1
 29.0    1
Name: Idade, dtype: int64

In [98]:
df.corr() #correlação

                  Idade  Projetos_Nota  Qualidade
Idade          1.000000      -0.471741  -0.458797
Projetos_Nota -0.471741       1.000000   0.027839
Qualidade     -0.458797       0.027839   1.000000

In [99]:
df.head(n=5) # 5 primeiros registros

   Idade  Nomes  Projetos_Nota  Qualidade
0   25.0    Tom              8       9.00
1   25.0    Tom              7       8.00
2   25.0  Ricky              3       3.98
3   30.0    Vin              4       4.50
4   29.0  Steve              3       4.20

In [100]:
df.tail(n=5) # 5 últimos registros

    Idade   Nomes  Projetos_Nota  Qualidade
7    30.0     Lee              3       3.78
8    51.0   David              2       2.98
9    46.0  Gasper              4       4.80
10    NaN  Betina             45       4.10
11    NaN  Andres              3       3.65

In [101]:
df['Idade'].describe() #descrevendo uma coluna

count    10.000000
mean     31.800000
std       9.461031
min      23.000000
25%      25.000000
50%      29.500000
75%      33.000000
max      51.000000
Name: Idade, dtype: float64

In [102]:
df.duplicated() #Verifica os registros duplicados

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [103]:
df.nunique() #Faz a contagem dos campos com valor único no dataset

Idade             7
Nomes            11
Projetos_Nota     6
Qualidade        12
dtype: int64

In [104]:
df.drop_duplicates() #Exclui as linhas duplicadas

    Idade   Nomes  Projetos_Nota  Qualidade
0    25.0     Tom              8       9.00
1    25.0     Tom              7       8.00
2    25.0   Ricky              3       3.98
3    30.0     Vin              4       4.50
4    29.0   Steve              3       4.20
5    23.0   Smith              4       4.60
6    34.0    Jack              3       3.80
7    30.0     Lee              3       3.78
8    51.0   David              2       2.98
9    46.0  Gasper              4       4.80
10    NaN  Betina             45       4.10
11    NaN  Andres              3       3.65

In [105]:
df.notnull() #Verifica os campos, se estão preenchidos (True) ou vazios (False)

    Idade  Nomes  Projetos_Nota  Qualidade
0    True   True           True       True
1    True   True           True       True
2    True   True           True       True
3    True   True           True       True
4    True   True           True       True
5    True   True           True       True
6    True   True           True       True
7    True   True           True       True
8    True   True           True       True
9    True   True           True       True
10  False   True           True       True
11  False   True           True       True